IDENTIFICATION DIVISION.
program-id. HELLO-WORLD.
*> A simple program to display the Hello, world!
procedure division.
       display "Hello, world!".
       STOP RUN.
