      ******************************************************************
      * Author: Victor Cruz
      * Date: 01/04/2020
      * Purpose: Run Hello, world!
      * Tectonics: cobc
      ******************************************************************
       IDENTIFICATION DIVISION.
       PROGRAM-ID. HELLO-WORLD.
       DATA DIVISION.
       FILE SECTION.
       WORKING-STORAGE SECTION.
       PROCEDURE DIVISION.
       MAIN-PROCEDURE.
           DISPLAY "HELLO, WORLD!".
           STOP RUN.
       END PROGRAM HELLO-WORLD.
